{
  "business_type": "AppSec Consulting + Security Tools",
  "founded": "",
  "status": "Active - Building client base",
  "website": "",
  "tagline": "Disrupting Auth Flows and Naptime Schedules",
  "team": {
    "brenda": {
      "role": "Founder & Operations Lead",
      "responsibilities": ["Client relations", "Project management", "Operations", "Security testing", "Consulting delivery"]
    },
    "gavin": {
      "role": "Co-Founder, Marketing & Tech Support",
      "responsibilities": ["Marketing strategy", "Technical support", "LinkedIn presence", "Tool development"]
    }
  },
  "mission_statement": "At TamperTantrum Labs, our mission is to make application security accessible, human, and empowering. We partner with developers, open-source teams, and startups to identify vulnerabilities, implement real-world protections, build developer-friendly security tools, and create safer software; not just for the sake of the app, but for the safety of the people who use it.",
  "vision": "TamperTantrum Labs envisions a future where application security is no longer an afterthought, but a natural part of how great software gets built, shared, taught, and championed by empowered developers everywhere.",
  "pitch": "TamperTantrum Labs discovers vulnerabilities and builds tools to help devs and small teams secure their apps without the drama. We test, teach, build security tools, and tamper-proof your products, so you can ship them safely.",
  "values": [
    {
      "name": "Developer-First Focus",
      "description": "We embed security directly into developers' workflows and tooling, so teams can ship safely without friction."
    },
    {
      "name": "Integrity",
      "description": "We deliver honest, jargon-free findings, clear pricing, and realistic timelines—always doing what's right, even when no one's watching."
    },
    {
      "name": "Collaborative Partnership",
      "description": "We work side-by-side with teams, sharing knowledge, co-creating fixes, and building mutual trust every step of the way."
    },
    {
      "name": "Agility & Accessibility",
      "description": "We respond quickly, offer tiered 'pay-as-you-grow' plans and low-cost office-hours support so even solo devs and seed-stage startups can get expert help."
    },
    {
      "name": "Continuous Innovation",
      "description": "We constantly refine our tooling and techniques; developing new security products, automating routine checks, exploring new AppSec approaches, and adapting based on real-world feedback."
    },
    {
      "name": "Community Empowerment",
      "description": "We invest in the open-source ecosystem by publishing accessible security tools, guides, contributing to projects, and hosting workshops so developers everywhere can build more secure software."
    },
    {
      "name": "Ownership & Accountability",
      "description": "We take full ownership of every engagement, track real outcomes, and stand by our recommendations from start to finish to ensure lasting security improvements."
    }
  ],
  "brand_story": {
    "full": "I started TamperTantrum Labs out of pure frustration, not with cybersecurity itself, but with the wall I kept hitting when trying to break into the industry. I earned my certifications, completed a cybersecurity degree, competed in CTFs, contributed to open-source security projects, and networked like crazy, but still, the job market wouldn't budge. Months passed. I had the skills, but no job offers. So I stopped waiting for permission and decided to make my own way in. TamperTantrum Labs is my way of doing what I love: helping real developers and small teams secure their apps, their users, and their peace of mind. I work with solo devs, open source maintainers, and startups who care about security, even if they don't know where to start. I don't believe in fear-mongering, gatekeeping, or burying people in jargon. I believe in practical security: testing real threats, building real defenses, and empowering people to think and build with security in mind. Whether it's threat modeling, web and API testing, CI/CD hardening, or simply showing someone how their app could be broken, I'm here to help devs and small teams secure what they're building, and learn while doing it. Because security isn't just about protecting software. It's about protecting the people who use it.",
    "short": "I started TamperTantrum Labs out of pure frustration, not with cybersecurity itself, but with the wall I kept hitting when trying to break into the industry. I earned my certifications, completed a cybersecurity degree, competed in CTFs, contributed to open-source security projects, and networked relentlessly, but the job market wouldn't budge. So I stopped waiting for permission and created my own path forward. TamperTantrum Labs is my way of doing what I love: helping real developers and small teams secure their apps without the gatekeeping, jargon, or fear-mongering that plagues this industry."
  },
  "positioning": {
    "statement": "TamperTantrum Labs is a hands-on, dev-first application security partner for solo developers, small teams, and early-stage startups. We combine real testing, security tools, and approachable education to help you ship safer apps, without fear, gatekeeping, or enterprise fluff.",
    "what_we_are": "Hands-on, dev-first AppSec partner combining consulting, tools, and education",
    "what_we_are_not": [
      "Enterprise security firm",
      "Penetration testing factory",
      "Checkbox compliance shop",
      "Fear-mongering consultancy"
    ],
    "differentiators": [
      "Accessible pricing with 'pay-as-you-grow' tiers",
      "Developer-friendly communication, no jargon",
      "Consulting + tooling bundles",
      "Office hours Slack support for fast, low-cost follow-up",
      "Builds OSS-first scripts and templates",
      "Focus on practical, actionable security"
    ],
    "summary": "Blends consulting (manual testing, threat modeling, SDLC coaching), tooling (lightweight dev-first security tools), and education (workshops, office hours, contributor-friendly docs) for a unique mix of accessibility, expertise, and empowerment."
  },
  "services": {
    "consulting": [
      "Manual testing",
      "Threat modeling",
      "SDLC coaching",
      "Auth flow reviews",
      "CI/CD hardening",
      "Web and API testing"
    ],
    "tooling": [
      "GitHub Actions for AppSec",
      "Lightweight SaaS security tools"
    ],
    "education": [
      "Workshops",
      "Office hours",
      "Contributor-friendly documentation"
    ]
  },
  "target_clients": [
    "Solo developers with commercial products",
    "Small development teams (2-10 people)",
    "Early-stage/seed-funded startups",
    "Open source project maintainers",
    "Freelance developers and small agencies",
    "Founders/PMs who need security clarity"
  ],
  "business_model": {
    "revenue_streams": {
      "year_1_target": "$50K+",
      "breakdown": {
        "consulting_audits": "60%",
        "education_training": "15%",
        "ongoing_advisory": "15%",
        "saas_tools": "10%+ by Year 2"
      }
    },
    "profitability_targets": {
      "services_margin": "40%+",
      "saas_margin": "80%+",
      "strategy": "Use service revenue to bootstrap SaaS; SaaS becomes primary profit driver by Year 3"
    },
    "pricing_philosophy": "Tiered 'pay-as-you-grow' plans, always have a free tier for tools, $9-49/mo per user for SaaS"
  },
  "saas_product_ideas": {
    "ci_cd_tools": [
      {"name": "SecurePipeline", "description": "GitHub/GitLab scanner"},
      {"name": "TamperCheck", "description": "PR auto scanner"},
      {"name": "VulnTracker", "description": "Simple vuln management"}
    ],
    "developer_tools": [
      {"name": "AuthAudit", "description": "Auth flow testing"},
      {"name": "APISecure", "description": "REST API security scanner"},
      {"name": "ThreatModel Builder", "description": "Accessible threat modeling"}
    ],
    "community_tools": [
      {"name": "SecurityOfficeHours", "description": "Consult booking tool"},
      {"name": "VulnLab", "description": "Interactive security labs"},
      {"name": "AppSecChecklist", "description": "Dynamic secure dev checklist"}
    ]
  }
}
